
**** i
#+BEGIN_SRC racket :require berkeley
  (cons (list 1 2) (cons 3 4))
#+END_SRC

#+RESULTS:
: ((1 2) 3 . 4)

**** ii

#+BEGIN_SRC racket :require berkeley
  (let ((p (list 4 5)))
    (cons (cdr p) (cddr p)))
#+END_SRC

#+RESULTS:
: ((5))

**** iii
#+BEGIN_SRC racket :require berkeley
  (cadadr '((a (b) c) (d (e) f) (g (h) i))
#+END_SRC

#+RESULTS:
: (e)

** 5. Recursive procedures

#+BEGIN_SRC racket :require berkeley
  (define (vowel? letter)
    (member? letter '(a e i o u)))
  (define (chop-consec-vowels w)
    (if (and
         (vowel? (first w))
         (and (not (empty? (butfirst w)))
              (vowel? (first (butfirst w)))))
        (chop-consec-vowels (butfirst w))
        w))
  (define (syllables w)
    (if (empty? w)
        0
        (let ((no-repeat (chop-consec-vowels w)))
          (if (vowel? (first no-repeat))
              (+ 1 (syllables (butfirst no-repeat)))
              (syllables (butfirst no-repeat))))))

  (display "banana=")
  (display (syllables 'banana))
  (newline)
  (display "aardvark=")
  (display (syllables 'aardvark))
  (newline)
  (display "cloud=")
  (display (syllables 'cloud))
  (newline)
#+END_SRC

#+RESULTS:
: banana=3
: aardvark=2
: cloud=1
: #<void>

This is probably not the best way to solve this, but I couldn't find any errors with the approach. The official solution looks much better though:
#+BEGIN_SRC racket :require berkeley
  (define (syllables wd)
    (define (chop wd)
      (cond ((empty? wd) "")
      ((vowel? (first wd))
      (chop (bf wd)))
      (else wd)) )
    (cond ((empty? wd) 0)
    ((vowel? (first wd)) (+ (syllables (chop wd)) 1))
    (else (syllables (bf wd))) )) 
#+END_SRC
- the trick here is that it first checks for the first letter of the original word and then calls chop before the recursive call

*** a.
obs.: Shorter, as taken from the course pdf, needed to adapted to use <= instead of < for the examples to work out

#+BEGIN_SRC racket :require berkeley
  (define (shorter? a b)
    (<= (count a) (count b)))

  (define (in-order? p? items)
    (if (empty? (bf items))
        #t
        (and (p? (first items) (first (bf items)))
             (in-order? p? (bf items)))))
  (in-order? shorter? '(i saw them standing together))
  (in-order? shorter? '(i saw her standing there))
  (in-order? < '(2 3 5 5 8 13))
  (in-order? <= '(2 3 5 5 8 13))
  (in-order? > '(23 14 7 5 2))
#+END_SRC

#+RESULTS:
: #t

*** b.

#+BEGIN_SRC racket :require berkeley
  (define (shorter? a b)
    (<= (count a) (count b)))

  (define (order-checker p?)
    (define (iter items)
      (if (empty? (bf items))
          #t
          (and (p? (first items) (first (bf items)))
               (iter (bf items)))))
    iter)

  (define length-ordered? (order-checker shorter?))
  (length-ordered? '(i saw them standing together))
  (length-ordered? '(i saw her standing there))
  ((order-checker <) '(2 3 5 5 8 13))
  ((order-checker <=)  '(2 3 5 5 8 13))
  ((order-checker >) '(23 14 7 5 2))
#+END_SRC

This could be defined in terms of `in-order`
#+BEGIN_SRC racket :require berkeley
  (define (order-checker pred)
    (lambda (sent) (in-order? pred sent)) )
#+END_SRC

#+RESULTS:
: #t

*** a and b.
#+BEGIN_SRC racket :require berkeley
  (define (make-time hr mn cat) (list hr mn cat))
  (define hour car)
  (define minute cadr)
  (define category caddr)

  (define (time-print-form t)
    (define (fmt-mn mn)
      (if (< mn 10)
          (word "0" mn)
          mn))
    (display (word (hour t) ":" (fmt-mn (minute t)) (category t)))
    (newline))

  (time-print-form (make-time 3 5 'pm))

  (define (24-hour t)
    (word
     (+ (hour t)
        (if (eq? (category t) 'am)
            0
            12))
     (minute t)))

  (24-hour (make-time 3 47 'pm))
#+END_SRC

#+RESULTS:
: 3:05pm
: 1547

the above solution for b is kind-of right - but it returns a word.. we could convert it ofc, but doing everything with numbers would be the following:
#+BEGIN_SRC racket :require berkeley
  (define (24-hour time)
    (+ (* (hour time) 100)
        (minute time)
        (if (equal? (category time) 'pm) 1200 0))) 
#+END_SRC

